Revit 2027 API
SpatialFieldManager.GetSpatialFieldManager Method
 Retrieves manager object for the given view or returns NULL
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static SpatialFieldManager GetSpatialFieldManager(
	View view
)
Public Shared Function GetSpatialFieldManager (
	view As View
) As SpatialFieldManager
public:
static SpatialFieldManager^ GetSpatialFieldManager(
	View^ view
)
static member GetSpatialFieldManager :
        view : View -> SpatialFieldManager
Parameters
view View
 View for which manager object is retrieved
Return Value
SpatialFieldManager
 Manager object for the view passed in the argument
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace